## <center> Customer Analytics: Preparing Data for Modeling <center>

In [11]:
# Import necessary libraries
import pandas as pd
import numpy as np

# Load the dataset
ds_jobs = pd.read_csv("C:/Users/uyen/Desktop/Real-World-Projects/Python/datasets/customer_train.csv")

# View the dataset
ds_jobs.head()

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
0,8949,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevant experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevant experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

**Requirements for columns:**
* Columns containing categories with only two factors must be stored as Booleans (bool).
* Columns containing integers only must be stored as 32-bit integers (int32).
* Columns containing floats must be stored as 16-bit floats (float16).
* Columns containing nominal categorical data must be stored as the category data type.
* Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.
* The DataFrame should be filtered to only contain students with 10 or more years of experience at companies with at least 1000 employees, as their recruiter base is suited to more experienced professionals at enterprise companies.

***Inquire the dataset before transformations using the .info() and .memory_usage() methods***

In [12]:
#inquire the dataset before transformations
ds_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   student_id              19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevant_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  job_change              19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [13]:
ds_jobs.memory_usage()

Index                        132
student_id                153264
city                      153264
city_development_index    153264
gender                    153264
relevant_experience       153264
enrolled_university       153264
education_level           153264
major_discipline          153264
experience                153264
company_size              153264
company_type              153264
last_new_job              153264
training_hours            153264
job_change                153264
dtype: int64

### Transforming data types

Columns containing integers only must be stored as 32-bit integers (int32).

In [14]:
#transform 'student_id' and 'training_hours' to 'int32'
ds_jobs['student_id'] = ds_jobs['student_id'].astype('int32')
ds_jobs['training_hours'] = ds_jobs['training_hours'].astype('int32')
ds_jobs[['student_id', 'training_hours']].dtypes

student_id        int32
training_hours    int32
dtype: object

Columns containing floats must be stored as 16-bit floats (float16).

In [15]:
#transform 'city_development_index' to 'float16'
ds_jobs['city_development_index'] = ds_jobs['city_development_index'].astype('float16')
ds_jobs['city_development_index'].dtypes

dtype('float16')

Columns containing categories with only two factors must be stored as Booleans (bool).

In [16]:
#transform 'relevant_experience' to 'boolean'
ds_jobs['relevant_experience'] = ds_jobs['relevant_experience'].map({'Has relevant experience': 1, 'No relevant experience': 0})
ds_jobs['relevant_experience'].unique()
ds_jobs['relevant_experience'] = ds_jobs['relevant_experience'].astype('bool')
ds_jobs['relevant_experience'].dtype

dtype('bool')

Columns containing categories with only two factors must be stored as Booleans (bool).

In [17]:
#transform 'job_change' to 'boolean'
ds_jobs['job_change'] = round(ds_jobs['job_change'], 0)
ds_jobs['job_change'].unique()
ds_jobs['job_change'] = ds_jobs['job_change'].astype('bool')
ds_jobs['job_change'].dtype

dtype('bool')

Columns containing nominal categorical data must be stored as the category data type.

In [18]:
#transform 'gender', 'major_discipline', 'company_type' to 'category'
col_cat = ['gender', 'major_discipline', 'company_type']
for i in col_cat:
    ds_jobs[i] = ds_jobs[i].astype('category')

ds_jobs[col_cat].dtypes

gender              category
major_discipline    category
company_type        category
dtype: object

Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.

In [19]:
#create an ordered list of cities
city_l = []
counter = np.arange(1,181)
for i in counter:
    s = 'city_' + str(i)
    city_l.append(s)
print(city_l)

['city_1', 'city_2', 'city_3', 'city_4', 'city_5', 'city_6', 'city_7', 'city_8', 'city_9', 'city_10', 'city_11', 'city_12', 'city_13', 'city_14', 'city_15', 'city_16', 'city_17', 'city_18', 'city_19', 'city_20', 'city_21', 'city_22', 'city_23', 'city_24', 'city_25', 'city_26', 'city_27', 'city_28', 'city_29', 'city_30', 'city_31', 'city_32', 'city_33', 'city_34', 'city_35', 'city_36', 'city_37', 'city_38', 'city_39', 'city_40', 'city_41', 'city_42', 'city_43', 'city_44', 'city_45', 'city_46', 'city_47', 'city_48', 'city_49', 'city_50', 'city_51', 'city_52', 'city_53', 'city_54', 'city_55', 'city_56', 'city_57', 'city_58', 'city_59', 'city_60', 'city_61', 'city_62', 'city_63', 'city_64', 'city_65', 'city_66', 'city_67', 'city_68', 'city_69', 'city_70', 'city_71', 'city_72', 'city_73', 'city_74', 'city_75', 'city_76', 'city_77', 'city_78', 'city_79', 'city_80', 'city_81', 'city_82', 'city_83', 'city_84', 'city_85', 'city_86', 'city_87', 'city_88', 'city_89', 'city_90', 'city_91', 'city_92', 'city_93', 'city_94', 'city_95', 'city_96', 'city_97', 'city_98', 'city_99', 'city_100', 'city_101', 'city_102', 'city_103', 'city_104', 'city_105', 'city_106', 'city_107', 'city_108', 'city_109', 'city_110', 'city_111', 'city_112', 'city_113', 'city_114', 'city_115', 'city_116', 'city_117', 'city_118', 'city_119', 'city_120', 'city_121', 'city_122', 'city_123', 'city_124', 'city_125', 'city_126', 'city_127', 'city_128', 'city_129', 'city_130', 'city_131', 'city_132', 'city_133', 'city_134', 'city_135', 'city_136', 'city_137', 'city_138', 'city_139', 'city_140', 'city_141', 'city_142', 'city_143', 'city_144', 'city_145', 'city_146', 'city_147', 'city_148', 'city_149', 'city_150', 'city_151', 'city_152', 'city_153', 'city_154', 'city_155', 'city_156', 'city_157', 'city_158', 'city_159', 'city_160', 'city_161', 'city_162', 'city_163', 'city_164', 'city_165', 'city_166', 'city_167', 'city_168', 'city_169', 'city_170', 'city_171', 'city_172', 'city_173', 'city_174', 'city_175', 'city_176', 'city_177', 'city_178', 'city_179', 'city_180']

In [21]:
#transform 'city' into 'ordered category'
city_order = pd.CategoricalDtype(categories=city_l, ordered=True)
ds_jobs['city'] = ds_jobs['city'].astype(city_order)
ds_jobs['city'].dtype

CategoricalDtype(categories=['city_1', 'city_2', 'city_3', 'city_4', 'city_5', 'city_6',
                  'city_7', 'city_8', 'city_9', 'city_10',
                  ...
                  'city_171', 'city_172', 'city_173', 'city_174', 'city_175',
                  'city_176', 'city_177', 'city_178', 'city_179', 'city_180'],
, ordered=True, categories_dtype=object)

Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.

In [22]:
#create an ordered list of 'enrolled_university' and transform to ordered category data type
enrolled_uni_l = ['no_enrollment', 'Part time course', 'Full time course']
enrolled_uni_order = pd.CategoricalDtype(categories=enrolled_uni_l, ordered=True)
ds_jobs['enrolled_university'] = ds_jobs['enrolled_university'].astype(enrolled_uni_order)
ds_jobs['enrolled_university'].dtype

CategoricalDtype(categories=['no_enrollment', 'Part time course', 'Full time course'], ordered=True, categories_dtype=object)

In [23]:
#create an ordered list of 'education_level' and transform into an ordered category data type
edlevel_l = ['Primary School', 'High School', 'Graduate', 'Masters', 'Phd']
ed_order = pd.CategoricalDtype(categories=edlevel_l, ordered=True)
ds_jobs['education_level'] = ds_jobs['education_level'].astype(ed_order)
ds_jobs['education_level'].dtype

CategoricalDtype(categories=['Primary School', 'High School', 'Graduate', 'Masters',
                  'Phd'],
, ordered=True, categories_dtype=object)

Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.

In [25]:
#create an ordered list of 'experience'
experience_l = []
for i in np.arange(1,21):
    experience_l.append(str(i))
# print(experience_l)
experience_l.insert(0, '<1')
experience_l.insert(22, '>20')

In [26]:
#transform 'experience' into an ordered category data type
experience_order = pd.CategoricalDtype(categories=experience_l, ordered=True)
ds_jobs['experience'] = ds_jobs['experience'].astype(experience_order)
ds_jobs['experience'].dtype

CategoricalDtype(categories=['<1', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10',
                  '11', '12', '13', '14', '15', '16', '17', '18', '19', '20',
                  '>20'],
, ordered=True, categories_dtype=object)

In [27]:
#create an ordered list of 'company_size' and transform into an ordered category data type
comp_size_l = ['<10', '10-49', '50-99', '100-499', '500-999', '1000-4999', '5000-9999', '10000+']
comp_size_order = pd.CategoricalDtype(categories=comp_size_l, ordered=True)
ds_jobs['company_size'] = ds_jobs['company_size'].astype(comp_size_order)
ds_jobs['company_size'].dtype

CategoricalDtype(categories=['<10', '10-49', '50-99', '100-499', '500-999', '1000-4999',
                  '5000-9999', '10000+'],
, ordered=True, categories_dtype=object)

Columns containing ordinal categorical data must be stored as ordered categories, and not mapped to numerical values, with an order that reflects the natural order of the column.

In [29]:
#create an ordered list of 'last_new_job'
last_new_job_l = []
for i in np.arange(1,5):
    last_new_job_l.append(str(i))
last_new_job_l.insert(0,'never')
last_new_job_l.insert(5, '>4')
last_new_job_l
#transform 'last_new_job' into an ordered category data type
last_new_job_order = pd.CategoricalDtype(categories=last_new_job_l, ordered=True)
ds_jobs['last_new_job'] = ds_jobs['last_new_job'].astype(last_new_job_order)
ds_jobs['last_new_job'].dtype

CategoricalDtype(categories=['never', '1', '2', '3', '4', '>4'], ordered=True, categories_dtype=object)

The DataFrame should be filtered to only contain students with 10 or more years of experience at companies with at least 1000 employees, as their recruiter base is suited to more experienced professionals at enterprise companies.

In [30]:
#filter ds_jobs for ore than 10 years experience and more than 1000 employees
experience_filter = ['10','11', '12', '13', '14', '15', '16', '17', '18', '19', '20','>20']
comp_size_filter = ['1000-4999','5000-9999', '10000+']
ds_jobs_filtered = ds_jobs[(ds_jobs['experience'].isin(experience_filter)) & (ds_jobs['company_size'].isin(comp_size_filter))]
ds_jobs_filtered.head(100)

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
9,699,city_103,0.919922,NaN,True,no_enrollment,Graduate,STEM,17,10000+,Pvt Ltd,>4,123,False
12,25619,city_61,0.913086,Male,True,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,False
31,22293,city_103,0.919922,Male,True,Part time course,Graduate,STEM,19,5000-9999,Pvt Ltd,>4,141,False
34,26494,city_16,0.910156,Male,True,no_enrollment,Graduate,Business Degree,12,5000-9999,Pvt Ltd,3,145,False
40,2547,city_114,0.925781,Female,True,Full time course,Masters,STEM,16,1000-4999,Public Sector,2,14,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
920,28453,city_16,0.910156,Male,True,no_enrollment,Masters,STEM,10,10000+,Pvt Ltd,1,18,False
931,6304,city_103,0.919922,Male,True,Part time course,Graduate,STEM,19,1000-4999,Public Sector,>4,142,False
933,31368,city_103,0.919922,Male,True,no_enrollment,Graduate,STEM,10,1000-4999,Pvt Ltd,1,314,False
959,21276,city_75,0.938965,Male,True,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,4,94,False
965,27419,city_21,0.624023,NaN,True,no_enrollment,Graduate,STEM,15,10000+,Pvt Ltd,never,17,False

The DataFrame should be filtered to only contain students with 10 or more years of experience at companies with at least 1000 employees, as their recruiter base is suited to more experienced professionals at enterprise companies.

In [31]:
#filter ds_jobs for ore than 10 years experience and more than 1000 employees
experience_filter = ['10','11', '12', '13', '14', '15', '16', '17', '18', '19', '20','>20']
comp_size_filter = ['1000-4999','5000-9999', '10000+']
ds_jobs_filtered = ds_jobs[(ds_jobs['experience'].isin(experience_filter)) & (ds_jobs['company_size'].isin(comp_size_filter))]
ds_jobs_filtered.head(100)

,student_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,job_change
9,699,city_103,0.919922,NaN,True,no_enrollment,Graduate,STEM,17,10000+,Pvt Ltd,>4,123,False
12,25619,city_61,0.913086,Male,True,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,False
31,22293,city_103,0.919922,Male,True,Part time course,Graduate,STEM,19,5000-9999,Pvt Ltd,>4,141,False
34,26494,city_16,0.910156,Male,True,no_enrollment,Graduate,Business Degree,12,5000-9999,Pvt Ltd,3,145,False
40,2547,city_114,0.925781,Female,True,Full time course,Masters,STEM,16,1000-4999,Public Sector,2,14,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
920,28453,city_16,0.910156,Male,True,no_enrollment,Masters,STEM,10,10000+,Pvt Ltd,1,18,False
931,6304,city_103,0.919922,Male,True,Part time course,Graduate,STEM,19,1000-4999,Public Sector,>4,142,False
933,31368,city_103,0.919922,Male,True,no_enrollment,Graduate,STEM,10,1000-4999,Pvt Ltd,1,314,False
959,21276,city_75,0.938965,Male,True,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,4,94,False
965,27419,city_21,0.624023,NaN,True,no_enrollment,Graduate,STEM,15,10000+,Pvt Ltd,never,17,False

In [32]:
ds_jobs_transformed = ds_jobs_filtered.copy(deep=True)

In [33]:
ds_jobs_transformed.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2201 entries, 9 to 19143
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   student_id              2201 non-null   int32
 1   city                    2201 non-null   category
 2   city_development_index  2201 non-null   float16
 3   gender                  1821 non-null   category
 4   relevant_experience     2201 non-null   bool
 5   enrolled_university     2185 non-null   category
 6   education_level         2184 non-null   category
 7   major_discipline        2097 non-null   category
 8   experience              2201 non-null   category
 9   company_size            2201 non-null   category
 10  company_type            2144 non-null   category
 11  last_new_job            2184 non-null   category
 12  training_hours          2201 non-null   int32
 13  job_change              2201 non-null   bool
dtypes: bool(2), category(9), float16(1), int32(2)
memory usage: 72.1 KB

In [34]:
ds_jobs_transformed.memory_usage()

Index                     17608
student_id                 8804
city                      10010
city_development_index     4402
gender                     2333
relevant_experience        2201
enrolled_university        2333
education_level            2413
major_discipline           2421
experience                 2933
company_size               2565
company_type               2421
last_new_job               2421
training_hours             8804
job_change                 2201
dtype: int64

There is a significant decrease in memory usage after the data type transformations